Revit 2027 API
FamilyInstance.CanRotate Property
Property to test whether the family instance can be rotated by 180 degrees.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanRotate { get; }
Public ReadOnly Property CanRotate As Boolean
	Get
public:
property bool CanRotate {
	bool get ();
}
member CanRotate : bool with get
Property Value
Boolean
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace